### Joins in MySQL

### 1. Inner Join

In [1]:
from mysql.connector import connect

#### Show those employees who has salary more than 5000. Return employee_id, first_name, department_name, salary.

In [9]:
my_db=connect(host="localhost", user="root", password="Theuserdied@8", database="hr")

my_cursor=my_db.cursor()

query='''SELECT A.employee_id, A.first_name, B.department_name, A.salary FROM EMPLOYEES AS A
         INNER JOIN DEPARTMENTS AS B
         ON A.DEPARTMENT_ID=B.DEPARTMENT_ID
         WHERE SALARY>5000'''
my_cursor.execute(query)

print("Employee_id", " "*10, "First_name", " "*10, "Department"," "*10, "Salary")
for record in my_cursor:
    print(record[0], " "*15, record[1], " "*15, record[2], " "*15, record[3])

Employee_id            First_name            Department            Salary
100                 Steven                 Executive                 24000.00
101                 Neena                 Executive                 17000.00
102                 Lex                 Executive                 17000.00
103                 Alexander                 IT                 9000.00
104                 Bruce                 IT                 6000.00
108                 Nancy                 Finance                 12000.00
109                 Daniel                 Finance                 9000.00
110                 John                 Finance                 8200.00
111                 Ismael                 Finance                 7700.00
112                 Jose Manuel                 Finance                 7800.00
113                 Luis                 Finance                 6900.00
114                 Den                 Purchasing                 11000.00
120                 Matthew                 Shipping                 8000.00
121                 Adam                 Shipping                 8200.00
122                 Payam                 Shipping                 7900.00
123                 Shanta                 Shipping                 6500.00
124                 Kevin                 Shipping                 5800.00
145                 John                 Sales                 14000.00
146                 Karen                 Sales                 13500.00
147                 Alberto                 Sales                 12000.00
148                 Gerald                 Sales                 11000.00
149                 Eleni                 Sales                 10500.00
150                 Peter                 Sales                 10000.00
151                 David                 Sales                 9500.00
152                 Peter                 Sales                 9000.00
153                 Christopher                 Sales                 8000.00
154                 Nanette                 Sales                 7500.00
155                 Oliver                 Sales                 7000.00
156                 Janette                 Sales                 10000.00
157                 Patrick                 Sales                 9500.00
158                 Allan                 Sales                 9000.00
159                 Lindsey                 Sales                 8000.00
160                 Louise                 Sales                 7500.00
161                 Sarath                 Sales                 7000.00
162                 Clara                 Sales                 10500.00
163                 Danielle                 Sales                 9500.00
164                 Mattea                 Sales                 7200.00
165                 David                 Sales                 6800.00
166                 Sundar                 Sales                 6400.00
167                 Amit                 Sales                 6200.00
168                 Lisa                 Sales                 11500.00
169                 Harrison                 Sales                 10000.00
170                 Tayler                 Sales                 9600.00
171                 William                 Sales                 7400.00
172                 Elizabeth                 Sales                 7300.00
173                 Sundita                 Sales                 6100.00
174                 Ellen                 Sales                 11000.00
175                 Alyssa                 Sales                 8800.00
176                 Jonathon                 Sales                 8600.00
177                 Jack                 Sales                 8400.00
179                 Charles                 Sales                 6200.00
201                 Michael                 Marketing                 13000.00
202                 Pat                 Marketing                 6000.00
203                 Susan                 Human Resources                 6500.00
204                 Hermann                 Public Relations                 10000.00
205                 Shelley                 Accounting                 12000.00
206                 William                 Accounting                 8300.00

### 2. Right Join

In [10]:
query='''SELECT A.employee_id, A.first_name, B.department_name, A.salary FROM EMPLOYEES AS A
         RIGHT JOIN DEPARTMENTS AS B
         ON A.DEPARTMENT_ID=B.DEPARTMENT_ID
         WHERE SALARY>5000'''
my_cursor.execute(query)

print("Employee_id", " "*10, "First_name", " "*10, "Department"," "*10, "Salary")
for record in my_cursor:
    print(record[0], " "*15, record[1], " "*15, record[2], " "*15, record[3])

Employee_id            First_name            Department            Salary
100                 Steven                 Executive                 24000.00
101                 Neena                 Executive                 17000.00
102                 Lex                 Executive                 17000.00
103                 Alexander                 IT                 9000.00
104                 Bruce                 IT                 6000.00
108                 Nancy                 Finance                 12000.00
109                 Daniel                 Finance                 9000.00
110                 John                 Finance                 8200.00
111                 Ismael                 Finance                 7700.00
112                 Jose Manuel                 Finance                 7800.00
113                 Luis                 Finance                 6900.00
114                 Den                 Purchasing                 11000.00
120                 Matthew                 Shipping                 8000.00
121                 Adam                 Shipping                 8200.00
122                 Payam                 Shipping                 7900.00
123                 Shanta                 Shipping                 6500.00
124                 Kevin                 Shipping                 5800.00
145                 John                 Sales                 14000.00
146                 Karen                 Sales                 13500.00
147                 Alberto                 Sales                 12000.00
148                 Gerald                 Sales                 11000.00
149                 Eleni                 Sales                 10500.00
150                 Peter                 Sales                 10000.00
151                 David                 Sales                 9500.00
152                 Peter                 Sales                 9000.00
153                 Christopher                 Sales                 8000.00
154                 Nanette                 Sales                 7500.00
155                 Oliver                 Sales                 7000.00
156                 Janette                 Sales                 10000.00
157                 Patrick                 Sales                 9500.00
158                 Allan                 Sales                 9000.00
159                 Lindsey                 Sales                 8000.00
160                 Louise                 Sales                 7500.00
161                 Sarath                 Sales                 7000.00
162                 Clara                 Sales                 10500.00
163                 Danielle                 Sales                 9500.00
164                 Mattea                 Sales                 7200.00
165                 David                 Sales                 6800.00
166                 Sundar                 Sales                 6400.00
167                 Amit                 Sales                 6200.00
168                 Lisa                 Sales                 11500.00
169                 Harrison                 Sales                 10000.00
170                 Tayler                 Sales                 9600.00
171                 William                 Sales                 7400.00
172                 Elizabeth                 Sales                 7300.00
173                 Sundita                 Sales                 6100.00
174                 Ellen                 Sales                 11000.00
175                 Alyssa                 Sales                 8800.00
176                 Jonathon                 Sales                 8600.00
177                 Jack                 Sales                 8400.00
179                 Charles                 Sales                 6200.00
201                 Michael                 Marketing                 13000.00
202                 Pat                 Marketing                 6000.00
203                 Susan                 Human Resources                 6500.00
204                 Hermann                 Public Relations                 10000.00
205                 Shelley                 Accounting                 12000.00
206                 William                 Accounting                 8300.00

### 3. LEFT  Join

In [11]:
query='''SELECT A.employee_id, A.first_name, B.department_name, A.salary FROM EMPLOYEES AS A
         LEFT JOIN DEPARTMENTS AS B
         ON A.DEPARTMENT_ID=B.DEPARTMENT_ID
         WHERE SALARY>5000'''
my_cursor.execute(query)

print("Employee_id", " "*10, "First_name", " "*10, "Department"," "*10, "Salary")
for record in my_cursor:
    print(record[0], " "*15, record[1], " "*15, record[2], " "*15, record[3])

Employee_id            First_name            Department            Salary
100                 Steven                 Executive                 24000.00
101                 Neena                 Executive                 17000.00
102                 Lex                 Executive                 17000.00
103                 Alexander                 IT                 9000.00
104                 Bruce                 IT                 6000.00
108                 Nancy                 Finance                 12000.00
109                 Daniel                 Finance                 9000.00
110                 John                 Finance                 8200.00
111                 Ismael                 Finance                 7700.00
112                 Jose Manuel                 Finance                 7800.00
113                 Luis                 Finance                 6900.00
114                 Den                 Purchasing                 11000.00
120                 Matthew                 Shipping                 8000.00
121                 Adam                 Shipping                 8200.00
122                 Payam                 Shipping                 7900.00
123                 Shanta                 Shipping                 6500.00
124                 Kevin                 Shipping                 5800.00
145                 John                 Sales                 14000.00
146                 Karen                 Sales                 13500.00
147                 Alberto                 Sales                 12000.00
148                 Gerald                 Sales                 11000.00
149                 Eleni                 Sales                 10500.00
150                 Peter                 Sales                 10000.00
151                 David                 Sales                 9500.00
152                 Peter                 Sales                 9000.00
153                 Christopher                 Sales                 8000.00
154                 Nanette                 Sales                 7500.00
155                 Oliver                 Sales                 7000.00
156                 Janette                 Sales                 10000.00
157                 Patrick                 Sales                 9500.00
158                 Allan                 Sales                 9000.00
159                 Lindsey                 Sales                 8000.00
160                 Louise                 Sales                 7500.00
161                 Sarath                 Sales                 7000.00
162                 Clara                 Sales                 10500.00
163                 Danielle                 Sales                 9500.00
164                 Mattea                 Sales                 7200.00
165                 David                 Sales                 6800.00
166                 Sundar                 Sales                 6400.00
167                 Amit                 Sales                 6200.00
168                 Lisa                 Sales                 11500.00
169                 Harrison                 Sales                 10000.00
170                 Tayler                 Sales                 9600.00
171                 William                 Sales                 7400.00
172                 Elizabeth                 Sales                 7300.00
173                 Sundita                 Sales                 6100.00
174                 Ellen                 Sales                 11000.00
175                 Alyssa                 Sales                 8800.00
176                 Jonathon                 Sales                 8600.00
177                 Jack                 Sales                 8400.00
178                 Kimberely                 None                 7000.00
179                 Charles                 Sales                 6200.00
201                 Michael                 Marketing                 13000.00
202                 Pat                 Marketing                 6000.00
203                 Susan                 Human Resources                 6500.00
204                 Hermann                 Public Relations                 10000.00
205                 Shelley                 Accounting                 12000.00
206                 William                 Accounting                 8300.00